In [4]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [5]:
myData = randn(3,4)

In [6]:
myData

array([[-0.05378218,  1.12927675, -0.19952151,  0.79864693],
       [-0.0557906 ,  2.14076433,  0.11985743, -2.09753563],
       [-0.5132184 ,  0.83103218, -0.05472261,  0.22815995]])

In [7]:
myDataframe = pd.DataFrame(myData,index = ['R1','R2','R3'],columns = ['C1','C2','C3','C4'])

In [9]:
myDataframe

          C1        C2        C3        C4
R1 -0.053782  1.129277 -0.199522  0.798647
R2 -0.055791  2.140764  0.119857 -2.097536
R3 -0.513218  0.831032 -0.054723  0.228160

In [10]:
myDataframe['C5'] = myDataframe['C1'] + myDataframe['C3']

In [11]:
myDataframe

          C1        C2        C3        C4        C5
R1 -0.053782  1.129277 -0.199522  0.798647 -0.253304
R2 -0.055791  2.140764  0.119857 -2.097536  0.064067
R3 -0.513218  0.831032 -0.054723  0.228160 -0.567941

In [15]:
myDataframe.drop('C2',axis=1,inplace = True)

In [16]:
myDataframe

          C1        C3        C4        C5
R1 -0.053782 -0.199522  0.798647 -0.253304
R2 -0.055791  0.119857 -2.097536  0.064067
R3 -0.513218 -0.054723  0.228160 -0.567941

In [17]:
myDataframe.loc['R1']

C1   -0.053782
C3   -0.199522
C4    0.798647
C5   -0.253304
Name: R1, dtype: float64

In [18]:
myDataframe.loc[['R1','R2'],['C1','C3']]

          C1        C3
R1 -0.053782 -0.199522
R2 -0.055791  0.119857

In [20]:
myDataframe.loc[['R2','R3'],['C4','C5']]

          C4        C5
R2 -2.097536  0.064067
R3  0.228160 -0.567941

In [21]:
myDataframe

          C1        C3        C4        C5
R1 -0.053782 -0.199522  0.798647 -0.253304
R2 -0.055791  0.119857 -2.097536  0.064067
R3 -0.513218 -0.054723  0.228160 -0.567941

In [22]:
myDataframe > 0

       C1     C3     C4     C5
R1  False  False   True  False
R2  False   True  False   True
R3  False  False   True  False

In [23]:
myDataframe[myDataframe > 0]

    C1        C3        C4        C5
R1 NaN       NaN  0.798647       NaN
R2 NaN  0.119857       NaN  0.064067
R3 NaN       NaN  0.228160       NaN

In [30]:
myDataframe[myDataframe['C3']>0]

          C1        C3        C4        C5
R2 -0.055791  0.119857 -2.097536  0.064067

In [31]:
myDataframe

          C1        C3        C4        C5
R1 -0.053782 -0.199522  0.798647 -0.253304
R2 -0.055791  0.119857 -2.097536  0.064067
R3 -0.513218 -0.054723  0.228160 -0.567941

In [32]:
myDataframe[(myDataframe['C3']>0) & (myDataframe['C5']>0)]

          C1        C3        C4        C5
R2 -0.055791  0.119857 -2.097536  0.064067

In [33]:
myDataframe[(myDataframe['C3']>0) | (myDataframe['C5']>0)]

          C1        C3        C4        C5
R2 -0.055791  0.119857 -2.097536  0.064067

In [38]:
myDataframe

          C1        C3        C4        C5
R1 -0.053782 -0.199522  0.798647 -0.253304
R2 -0.055791  0.119857 -2.097536  0.064067
R3 -0.513218 -0.054723  0.228160 -0.567941

In [35]:
myNewIndex = ['row1','row2','row3']

In [36]:
myNewIndex

['row1', 'row2', 'row3']

In [40]:
myDataframe['Newindex'] = myNewIndex

In [41]:
myDataframe.set_index('Newindex')

                C1        C3        C4        C5
Newindex
row1     -0.053782 -0.199522  0.798647 -0.253304
row2     -0.055791  0.119857 -2.097536  0.064067
row3     -0.513218 -0.054723  0.228160 -0.567941

In [50]:
mynewindex2 = ['col1','col2','col3','col4','col5']

In [51]:
mynewindex2

['col1', 'col2', 'col3', 'col4', 'col5']

In [58]:
myDataframe.columns = mynewindex2

In [59]:
myDataframe

                col1       col2      col3       col4  col5
R1        -0.0537822  -0.199522  0.798647  -0.253304  row1
R2        -0.0557906   0.119857  -2.09754  0.0640668  row2
R3         -0.513218 -0.0547226   0.22816  -0.567941  row3
newindex2       col1       col2      col3       col4  col5